modm-ext/data.modm.io/docs/svd/header_stm32h7b0xxq.svd
        <register>
          <name>CFG1</name>
          <description>SPI Configuration register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSIZE</name>
              <description>DSIZE[4:0]: Bits number in single SPI data frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATAWIDTH_4BIT</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_5BIT</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_6BIT</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_7BIT</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_8BIT</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_9BIT</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_10BIT</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_11BIT</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_12BIT</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_13BIT</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_14BIT</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_15BIT</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_16BIT</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_17BIT</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_18BIT</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_19BIT</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_20BIT</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_21BIT</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_22BIT</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_23BIT</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_24BIT</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_25BIT</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_26BIT</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_27BIT</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_28BIT</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_29BIT</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_30BIT</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_31BIT</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAWIDTH_32BIT</name>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTHLV</name>
              <description>FTHVL [3:0]: FIFO threshold level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TH_01DATA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_02DATA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_03DATA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_04DATA</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_05DATA</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_06DATA</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_07DATA</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_08DATA</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_09DATA</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_10DATA</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_11DATA</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_12DATA</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_13DATA</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_14DATA</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_15DATA</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TH_16DATA</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UDRCFG</name>
              <description>UDRCFG[1:0]: Behavior of transmitter at underrun</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGISTER_PATTERN</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST_RECEIVED</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST_TRANSMITTED</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UDRDET</name>
              <description>UDRDET[1:0]: Detection of underrun condition</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEGIN_DATA_FRAME</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END_DATA_FRAME</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEGIN_ACTIVE_NSS</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>Rx DMA stream enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>Tx DMA stream enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCSIZE</name>
              <description>CRCSIZE [4:0]: Length of CRC frame</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_4BIT</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_5BIT</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_6BIT</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_7BIT</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_8BIT</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_9BIT</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_10BIT</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_11BIT</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_12BIT</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_13BIT</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_14BIT</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_15BIT</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_16BIT</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_17BIT</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_18BIT</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_19BIT</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_20BIT</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_21BIT</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_22BIT</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_23BIT</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_24BIT</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_25BIT</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_26BIT</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_27BIT</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_28BIT</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_29BIT</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_30BIT</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_31BIT</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_32BIT</name>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCEN</name>
              <description>Hardware CRC computation enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBR</name>
              <description>Master baud rate</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
