modm-ext/data.modm.io/docs/svd/header_stm32h7b0xxq.svd
        <register>
          <name>FLT0FCR</name>
          <description>DFSDM filter control register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IOSR</name>
              <description>IOSR[7:0] Integrator oversampling ratio (averaging length)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FOSR</name>
              <description>FOSR[9:0] Sinc filter oversampling ratio (decimation rate)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>FORD</name>
              <description>FORD[2:0] Sinc filter order</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0JDATAR</name>
          <description>DFSDM data register for injected group</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JDATACH</name>
              <description>JDATACH[2:0] Injected channel most recently converted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>JDATA</name>
              <description>JDATA[23:0] Injected group conversion data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0RDATAR</name>
          <description>DFSDM data register for regular group</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RDATACH</name>
              <description>RDATACH[2:0] Regular channel most recently converted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RPEND</name>
              <description>RPEND Regular channel pending data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDATA</name>
              <description>RDATA[23:0] Regular channel conversion data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0AWHTR</name>
          <description>DFSDM analog watchdog high threshold register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BKAWH</name>
              <description>BKAWH[3:0] Break signal assignment to analog watchdog high threshold event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWHT</name>
              <description>AWHT[23:0] Analog watchdog high threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0AWLTR</name>
          <description>DFSDM analog watchdog low threshold register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BKAWL</name>
              <description>BKAWL[3:0] Break signal assignment to analog watchdog low threshold event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWLT</name>
              <description>AWHT[23:0] Analog watchdog low threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0AWSR</name>
          <description>DFSDM analog watchdog status register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWLTF</name>
              <description>AWLTF[7:0] Analog watchdog low threshold error on given channels</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AWHTF</name>
              <description>AWHTF[15:8] Analog watchdog high threshold error on given channels</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0AWCFR</name>
          <description>DFSDM analog watchdog clear flag register</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLRAWLTF</name>
              <description>CLRAWLTF[7:0] Clear the Analog watchdog low threshold flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRAWHTF</name>
              <description>CLRAWHTF[15:8] Clear the Analog watchdog high threshold flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0EXMAX</name>
          <description>DFSDM extreme detector maximum register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXMAXCH</name>
              <description>EXMAXCH[2:0] Extreme detector maximum data channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMAX</name>
              <description>EXMAX[23:0] Extreme detector maximum value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0EXMIN</name>
          <description>DFSDM extreme detector minimum register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXMINCH</name>
              <description>EXMINCH[2:0] Extreme detector minimum data channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXMIN</name>
              <description>EXMIN[23:0] Extreme detector minimum value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT0CNVTIMR</name>
          <description>DFSDM conversion timer</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNVCNT</name>
              <description>CNVCNT[27:0]: 28-bit timer counting conversion time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
            </field>
          </fields>
        </register>
